package lesson2;

import java.util.Scanner;

/*
Дано четное число N (>0) и символы c1 и c2.
Написать метод, который вернет строку длины N, состоящую из чередующихся символов c1 и c2, начиная с c1.
*/
public class FirstTask {
    int n;
    char a,b;

    public FirstTask(){
        Scanner in = new Scanner(System.in);
        System.out.println("Введите четное число, выше 0: ");
    }
}
